In [3]:
import pandas as pd

# Aluno: Davi Rodrigues do Nascimento
# Prof.: Howard 
# Disciplina: Análise de Dados Aplicada a Computação

## 1 - Criação do Dataframe

In [45]:
dados = {
    "loja": ["ShopFast", "ElectroStore", "FashionTrend", "OrganicMart", "DigitalWorld", "SafeBuy", "GameZone"],
    "http_status": ["200", "404", "200", "500", "200", "403", "404"],
    "response_time": [0.05, 0.12, 0.07, 0.20, 0.06, 0.09, 0.15],
}
df = pd.DataFrame(dados)

In [46]:
df

           loja http_status  response_time
0      ShopFast         200           0.05
1  ElectroStore         404           0.12
2  FashionTrend         200           0.07
3   OrganicMart         500           0.20
4  DigitalWorld         200           0.06
5       SafeBuy         403           0.09
6      GameZone         404           0.15

### (a) Filtrar apenas os sites que retornaram HTTP Status 200

In [47]:
df_200 = df[df["http_status"] == "200"]

In [48]:
df_200

           loja http_status  response_time
0      ShopFast         200           0.05
2  FashionTrend         200           0.07
4  DigitalWorld         200           0.06

### (b) Filtrar apenas os sites cujo tempo de resposta seja menor que 0.08 ms

In [49]:
df_menor_008 = df[df["response_time"] < 0.08]

In [50]:
df_menor_008

           loja http_status  response_time
0      ShopFast         200           0.05
2  FashionTrend         200           0.07
4  DigitalWorld         200           0.06

### (c) Reindexar o DataFrame

In [51]:
new_index = ["L1", "L2", "L3", "L4", "L5", "L6", "L7"]

In [52]:
df.index = new_index

In [53]:
df

            loja http_status  response_time
L1      ShopFast         200           0.05
L2  ElectroStore         404           0.12
L3  FashionTrend         200           0.07
L4   OrganicMart         500           0.20
L5  DigitalWorld         200           0.06
L6       SafeBuy         403           0.09
L7      GameZone         404           0.15

### (d) Refazer os filtros anteriores e verificar os resultados

#### (d.1) Apenas com Status 200

In [54]:
df_status200 = df[df["http_status"] == "200"]

In [55]:
df_status200

            loja http_status  response_time
L1      ShopFast         200           0.05
L3  FashionTrend         200           0.07
L5  DigitalWorld         200           0.06

#### (d.2) Tempo de resposta menor que 0.08 ms

In [56]:
df_menor_008 = df[df["response_time"] < 0.08]

In [57]:
df_menor_008

            loja http_status  response_time
L1      ShopFast         200           0.05
L3  FashionTrend         200           0.07
L5  DigitalWorld         200           0.06

### (e) Atualizar os dados da loja "SafeBuy"

In [58]:
df.loc[df["loja"] == "SafeBuy", 
[
    "http_status",
    "response_time"
]] = [501, 10.0]

In [59]:
df

            loja http_status  response_time
L1      ShopFast         200           0.05
L2  ElectroStore         404           0.12
L3  FashionTrend         200           0.07
L4   OrganicMart         500           0.20
L5  DigitalWorld         200           0.06
L6       SafeBuy         501          10.00
L7      GameZone         404           0.15

### (f) Atualizar os dados da loja "GameZone"

In [60]:
df.loc[df["loja"] == "GameZone", 
[
    "http_status",
    "response_time"
]] = ["503", 8.0]

In [61]:
df

            loja http_status  response_time
L1      ShopFast         200           0.05
L2  ElectroStore         404           0.12
L3  FashionTrend         200           0.07
L4   OrganicMart         500           0.20
L5  DigitalWorld         200           0.06
L6       SafeBuy         501          10.00
L7      GameZone         503           8.00

### (g) Descobrir quais índices foram removidos na reindexação e restaurá-los

In [62]:
df.reset_index(drop=True, inplace=True)

In [65]:
df

           loja http_status  response_time
0      ShopFast         200           0.05
1  ElectroStore         404           0.12
2  FashionTrend         200           0.07
3   OrganicMart         500           0.20
4  DigitalWorld         200           0.06
5       SafeBuy         501          10.00
6      GameZone         503           8.00

### (h) Adicionar uma nova coluna com as versões atuais das lojas

In [66]:
versoes = {
    'ShopFast': 5.4,
    'ElectroStore': 3.9,
    'FashionTrend': 6.1,
    'OrganicMart': 4.3,
    'DigitalWorld': 5.8,
    'SafeBuy': 4.9,
    'GameZone': 6.2
}

df["system_v"] = df["loja"].map(versoes)
df

           loja http_status  response_time  system_v
0      ShopFast         200           0.05       5.4
1  ElectroStore         404           0.12       3.9
2  FashionTrend         200           0.07       6.1
3   OrganicMart         500           0.20       4.3
4  DigitalWorld         200           0.06       5.8
5       SafeBuy         501          10.00       4.9
6      GameZone         503           8.00       6.2

## 2 - Exploração de métodos do Pandas

In [67]:

data = {
    "ID": [1, 2, 3, 4, 5, 5, 6, 7, None, 9],
    "Nome": ["Alice", "Bob", "Charlie", "David", "Emma", "Emma", "Frank", None, "Hannah", "Isaac"],
    "Idade": [25, 30, None, 40, 35, 35, 28, 22, 31, None]
}

In [68]:
df = pd.DataFrame(data)

In [69]:
df

    ID     Nome  Idade
0  1.0    Alice   25.0
1  2.0      Bob   30.0
2  3.0  Charlie    NaN
3  4.0    David   40.0
4  5.0     Emma   35.0
5  5.0     Emma   35.0
6  6.0    Frank   28.0
7  7.0     None   22.0
8  NaN   Hannah   31.0
9  9.0    Isaac    NaN

##### dropna() : Remove todas as linhas que possuem, ao menos, um valor nulo

In [71]:
df.dropna()

    ID   Nome  Idade
0  1.0  Alice   25.0
1  2.0    Bob   30.0
3  4.0  David   40.0
4  5.0   Emma   35.0
5  5.0   Emma   35.0
6  6.0  Frank   28.0

##### drop_duplicates() : Remove as linhas duplicadas do dataframe, mantendo apenas a primeira ocorrência

In [72]:
df.drop_duplicates()

    ID     Nome  Idade
0  1.0    Alice   25.0
1  2.0      Bob   30.0
2  3.0  Charlie    NaN
3  4.0    David   40.0
4  5.0     Emma   35.0
6  6.0    Frank   28.0
7  7.0     None   22.0
8  NaN   Hannah   31.0
9  9.0    Isaac    NaN

##### merge() :

In [77]:
df_clientes = pd.DataFrame({
    "ID_Cliente": [1, 2, 3, 4],
    "Nome": ["Alice", "Bob", "Carlos", "Diana"],
    "Idade": [25, 30, 35, 40]
})

df_compras = pd.DataFrame({
    "ID_Cliente": [2, 3, 3, 4, 5],
    "Produto": ["Notebook", "Celular", "Fone de Ouvido", "Tablet", "Smartwatch"],
    "Valor": [5000, 2000, 300, 1500, 800]
})

###### Inner Join -> Mantém apenas os registros que possuem correspondências em ambas as tabelas
- Se um cliente não tiver compras registradas, ele será removido do resultado final.

In [83]:
df_merged = df_clientes.merge(df_compras, on="ID_Cliente", how="inner")
df_merged

   ID_Cliente    Nome  Idade         Produto  Valor
0           2     Bob     30        Notebook   5000
1           3  Carlos     35         Celular   2000
2           3  Carlos     35  Fone de Ouvido    300
3           4   Diana     40          Tablet   1500

###### Left join -> Mantém todos os clientes da tabela df_clientes, mesmo que estes não possuam compras
- Se um cliente não tiver compras, os valores da tabela df_compras aparecerão como NaN.

In [82]:
df_merged_left = df_clientes.merge(df_compras, on="ID_Cliente", how="left")
df_merged_left

   ID_Cliente    Nome  Idade         Produto   Valor
0           1   Alice     25             NaN     NaN
1           2     Bob     30        Notebook  5000.0
2           3  Carlos     35         Celular  2000.0
3           3  Carlos     35  Fone de Ouvido   300.0
4           4   Diana     40          Tablet  1500.0

##### concat() : Utilizado para empilhar dataframes verticalmente

In [85]:
df_eletronicos = pd.DataFrame({
    "Produto": ["Celular", "AirPods", "SmartWatch"],
    "Preço": [2500, 600, 1400]
})

df_eletrodomesticos = pd.DataFrame({
    "Produto": ["Micro-ondas", "Lava-louça", "Geladeira"],
    "Preço": [600, 1200, 1800]
})

In [86]:
df_final = pd.concat([df_eletronicos, df_eletrodomesticos], axis=0)

In [87]:
df_final

       Produto  Preço
0      Celular   2500
1      AirPods    600
2   SmartWatch   1400
0  Micro-ondas    600
1   Lava-louça   1200
2    Geladeira   1800

###### Para redefinição os index

In [90]:
df_final = df_final.reset_index(drop=True)

In [91]:
df_final

       Produto  Preço
0      Celular   2500
1      AirPods    600
2   SmartWatch   1400
3  Micro-ondas    600
4   Lava-louça   1200
5    Geladeira   1800

##### groupby

In [92]:
df_vendas = pd.DataFrame({
    "Categoria": ["Eletrônicos", "Eletrodomésticos", "Eletrônicos", "Móveis", "Móveis", "Eletrodomésticos", "Eletrônicos"],
    "Produto": ["Notebook", "Geladeira", "Smartphone", "Sofá", "Mesa", "Fogão", "Fone de Ouvido"],
    "Vendas": [5000, 3200, 2500, 1800, 1200, 1500, 800]
})

In [98]:
df_agrupado = df_vendas.groupby("Categoria")["Vendas"].sum().reset_index()

In [99]:
df_agrupado

          Categoria  Vendas
0  Eletrodomésticos    4700
1       Eletrônicos    8300
2            Móveis    3000